{
    "projects":
    [
        {
            "title": "Psyches of Color",
            "description": "As a developer for TSE, I am working on a mobile app for Psyches of Color, a nonprofit organization dedicated to raising mental health awareness for Black and Latinx communities.",
            "image": "tse-logo-yellow.png",
            "alt": "Psyches of Color app",
            "role": "Software Developer",
            "technologies": "React Native, Node.js, Express.js, MongoDB",
            "contributions": "Developing core app features, ensuring secure authentication, and maintaining code quality.",
            "bullets": "Developing the app using React Native, Node.js, Express.js, and MongoDB.|Implementing secure environment variables for sensitive data handling.|Establishing coding standards with Prettier and ESLint for maintainability.",
            "link": "https://tritonse.github.io/"
        },
        {
            "title": "YouLostIt",
            "description": "YouLostIt is a privacy-focused lost item tracker developed as part of the CSE 190: Wireless Embedded Systems course.",
            "image": "youlostit.png",
            "alt": "STM32CubeIDE",
            "role": "Embedded Systems Engineer",
            "technologies": "STM32, C, Bluetooth Low-Energy",
            "contributions": "Designed game mechanics, improved UI, and enhanced user experience.",
            "bullets": "Designed a motion detection system on STM32 to simulate a lost-tag tracker.|Implemented I2C communication and LED feedback for real-time motion alerts.|Utilized ITM Console debugging for optimized hardware communication.|Developed firmware to manage sensors, radios, and power efficiently.",
            "link": "https://github.com/ucsd-cse190b-w25/project-3-adding-low-energy-radio-communication-team-6/blob/main/youlostit-ble/Core/Src/main.c"
        },
        {
            "title": "Mario's Playground",
            "description": "Developed as part of the WIC project teams, this Nintendo-themed website offers a collection of interactive games featuring beloved characters.",
            "bullets": "Designed and developed the MarioCoinfall game using HTML, CSS, and JavaScript.|Implemented player movement, coin collection, and bomb collision mechanics.|Built a Mario-themed homepage with intuitive navigation and interactive elements.|Optimized code for smooth performance across devices.",
            "image": "wic.png",
            "alt": "Mario's Playground screenshot",
            "role": "Frontend Developer",
            "technologies": "HTML, CSS, JavaScript",
            "contributions":  "Integrated scheduling, improved communication, and optimized volunteer coordination.",
            "link": "https://alexisvvega.github.io/Team11/"
        },
        {
            "title": "Nova Spero",
            "description": "As part of UCSD's Design for Development course, my team partnered with Nova Spero, a nonprofit organization dedicated to supporting refugee communities through education.",
            "bullets": "Integrated Google Calendar for streamlined scheduling.| Developed tools for efficient carpool coordination.|Implemented Remind App integration for mass communication.|Organized Google Drive for structured data management.",
            "image": "novaSpero.png",
            "alt": "Nova Spero project",
            "role": "UX Designer & Developer",
            "technologies": "Google Calendar, Remind App",
            "contributions": "Designed motion detection logic, developed firmware, and optimized power consumption.",
            "link": "https://novaspero.org"
        }
    ]
}